node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "ReadFile"
  op: "ReadFile"
  input: "Placeholder"
}
node {
  name: "DecodeWav"
  op: "DecodeWav"
  input: "ReadFile"
  attr {
    key: "desired_channels"
    value {
      i: 1
    }
  }
  attr {
    key: "desired_samples"
    value {
      i: 16000
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Mul"
  op: "Mul"
  input: "DecodeWav"
  input: "Placeholder_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Placeholder_3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "Pad"
  op: "Pad"
  input: "Mul"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\200>\000\000\377\377\377\377"
      }
    }
  }
}
node {
  name: "Slice"
  op: "Slice"
  input: "Pad"
  input: "Placeholder_3"
  input: "Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Placeholder_4"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16000
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "Placeholder_5"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Mul_1"
  op: "Mul"
  input: "Placeholder_4"
  input: "Placeholder_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Add"
  op: "Add"
  input: "Mul_1"
  input: "Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "clip_by_value/Minimum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "clip_by_value/Minimum"
  op: "Minimum"
  input: "Add"
  input: "clip_by_value/Minimum/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "clip_by_value/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.0
      }
    }
  }
}
node {
  name: "clip_by_value"
  op: "Maximum"
  input: "clip_by_value/Minimum"
  input: "clip_by_value/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "AudioSpectrogram"
  op: "AudioSpectrogram"
  input: "clip_by_value"
  attr {
    key: "magnitude_squared"
    value {
      b: true
    }
  }
  attr {
    key: "stride"
    value {
      i: 320
    }
  }
  attr {
    key: "window_size"
    value {
      i: 320
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/sample_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 16000.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/lower_edge_hertz"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 20.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/upper_edge_hertz"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 4000.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 0.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 2.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/truediv"
  op: "RealDiv"
  input: "linear_to_mel_weight_matrix/sample_rate"
  input: "linear_to_mel_weight_matrix/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/LinSpace/num"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 257
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/LinSpace"
  op: "LinSpace"
  input: "linear_to_mel_weight_matrix/Const"
  input: "linear_to_mel_weight_matrix/truediv"
  input: "linear_to_mel_weight_matrix/LinSpace/num"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/strided_slice"
  op: "StridedSlice"
  input: "linear_to_mel_weight_matrix/LinSpace"
  input: "linear_to_mel_weight_matrix/strided_slice/stack"
  input: "linear_to_mel_weight_matrix/strided_slice/stack_1"
  input: "linear_to_mel_weight_matrix/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 700.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/truediv"
  op: "RealDiv"
  input: "linear_to_mel_weight_matrix/strided_slice"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/add"
  op: "Add"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/add/x"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/Log"
  op: "Log"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/add"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1127.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel/mul"
  op: "Mul"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/mul/x"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/Log"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/ExpandDims"
  op: "ExpandDims"
  input: "linear_to_mel_weight_matrix/hertz_to_mel/mul"
  input: "linear_to_mel_weight_matrix/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 700.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/truediv"
  op: "RealDiv"
  input: "linear_to_mel_weight_matrix/lower_edge_hertz"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/add"
  op: "Add"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/add/x"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/Log"
  op: "Log"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/add"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1127.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_1/mul"
  op: "Mul"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/mul/x"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/Log"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/truediv/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 700.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/truediv"
  op: "RealDiv"
  input: "linear_to_mel_weight_matrix/upper_edge_hertz"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/truediv/y"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/add"
  op: "Add"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/add/x"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/Log"
  op: "Log"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/add"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
        }
        double_val: 1127.0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/hertz_to_mel_2/mul"
  op: "Mul"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/mul/x"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/Log"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/LinSpace_1/num"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 22
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/LinSpace_1"
  op: "LinSpace"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_1/mul"
  input: "linear_to_mel_weight_matrix/hertz_to_mel_2/mul"
  input: "linear_to_mel_weight_matrix/LinSpace_1/num"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/frame_length"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/frame_step"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range"
  op: "Range"
  input: "linear_to_mel_weight_matrix/frame/range/start"
  input: "linear_to_mel_weight_matrix/frame/Rank"
  input: "linear_to_mel_weight_matrix/frame/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/add"
  op: "Add"
  input: "linear_to_mel_weight_matrix/frame/axis"
  input: "linear_to_mel_weight_matrix/frame/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/strided_slice/stack"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/axis"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/strided_slice/stack_1"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/add"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/strided_slice"
  op: "StridedSlice"
  input: "linear_to_mel_weight_matrix/frame/range"
  input: "linear_to_mel_weight_matrix/frame/strided_slice/stack"
  input: "linear_to_mel_weight_matrix/frame/strided_slice/stack_1"
  input: "linear_to_mel_weight_matrix/frame/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 22
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/sub"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/frame/Rank"
  input: "linear_to_mel_weight_matrix/frame/sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/sub_1"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/frame/sub"
  input: "linear_to_mel_weight_matrix/frame/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/packed/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/packed"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/strided_slice"
  input: "linear_to_mel_weight_matrix/frame/packed/1"
  input: "linear_to_mel_weight_matrix/frame/sub_1"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/split"
  op: "SplitV"
  input: "linear_to_mel_weight_matrix/frame/Shape"
  input: "linear_to_mel_weight_matrix/frame/packed"
  input: "linear_to_mel_weight_matrix/frame/split/split_dim"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tlen"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "num_split"
    value {
      i: 3
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/frame/split:1"
  input: "linear_to_mel_weight_matrix/frame/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Size"
  op: "Size"
  input: "linear_to_mel_weight_matrix/frame/split"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Size_1"
  op: "Size"
  input: "linear_to_mel_weight_matrix/frame/split:2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/sub_2"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/frame/Reshape"
  input: "linear_to_mel_weight_matrix/frame/frame_length"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/floordiv"
  op: "FloorDiv"
  input: "linear_to_mel_weight_matrix/frame/sub_2"
  input: "linear_to_mel_weight_matrix/frame/frame_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/add_1/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/add_1"
  op: "Add"
  input: "linear_to_mel_weight_matrix/frame/add_1/x"
  input: "linear_to_mel_weight_matrix/frame/floordiv"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Maximum/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Maximum"
  op: "Maximum"
  input: "linear_to_mel_weight_matrix/frame/Maximum/x"
  input: "linear_to_mel_weight_matrix/frame/add_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/gcd/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/floordiv_1"
  op: "FloorDiv"
  input: "linear_to_mel_weight_matrix/frame/frame_length"
  input: "linear_to_mel_weight_matrix/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/floordiv_2"
  op: "FloorDiv"
  input: "linear_to_mel_weight_matrix/frame/frame_step"
  input: "linear_to_mel_weight_matrix/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/floordiv_3"
  op: "FloorDiv"
  input: "linear_to_mel_weight_matrix/frame/Reshape"
  input: "linear_to_mel_weight_matrix/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/mul"
  op: "Mul"
  input: "linear_to_mel_weight_matrix/frame/floordiv_3"
  input: "linear_to_mel_weight_matrix/frame/gcd/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat/values_1"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/mul"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat"
  op: "ConcatV2"
  input: "linear_to_mel_weight_matrix/frame/split"
  input: "linear_to_mel_weight_matrix/frame/concat/values_1"
  input: "linear_to_mel_weight_matrix/frame/split:2"
  input: "linear_to_mel_weight_matrix/frame/concat/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat_1/values_1"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/floordiv_3"
  input: "linear_to_mel_weight_matrix/frame/gcd/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat_1"
  op: "ConcatV2"
  input: "linear_to_mel_weight_matrix/frame/split"
  input: "linear_to_mel_weight_matrix/frame/concat_1/values_1"
  input: "linear_to_mel_weight_matrix/frame/split:2"
  input: "linear_to_mel_weight_matrix/frame/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/zeros_like"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/ones_like/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/ones_like"
  op: "Fill"
  input: "linear_to_mel_weight_matrix/frame/ones_like/Shape"
  input: "linear_to_mel_weight_matrix/frame/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/StridedSlice"
  op: "StridedSlice"
  input: "linear_to_mel_weight_matrix/LinSpace_1"
  input: "linear_to_mel_weight_matrix/frame/zeros_like"
  input: "linear_to_mel_weight_matrix/frame/concat"
  input: "linear_to_mel_weight_matrix/frame/ones_like"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_1"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/frame/StridedSlice"
  input: "linear_to_mel_weight_matrix/frame/concat_1"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range_1"
  op: "Range"
  input: "linear_to_mel_weight_matrix/frame/range_1/start"
  input: "linear_to_mel_weight_matrix/frame/Maximum"
  input: "linear_to_mel_weight_matrix/frame/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/mul_1"
  op: "Mul"
  input: "linear_to_mel_weight_matrix/frame/range_1"
  input: "linear_to_mel_weight_matrix/frame/floordiv_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_2/shape/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_2/shape"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/Maximum"
  input: "linear_to_mel_weight_matrix/frame/Reshape_2/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_2"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/frame/mul_1"
  input: "linear_to_mel_weight_matrix/frame/Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/range_2"
  op: "Range"
  input: "linear_to_mel_weight_matrix/frame/range_2/start"
  input: "linear_to_mel_weight_matrix/frame/floordiv_1"
  input: "linear_to_mel_weight_matrix/frame/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_3/shape/0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_3/shape"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/Reshape_3/shape/0"
  input: "linear_to_mel_weight_matrix/frame/floordiv_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_3"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/frame/range_2"
  input: "linear_to_mel_weight_matrix/frame/Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/add_2"
  op: "Add"
  input: "linear_to_mel_weight_matrix/frame/Reshape_2"
  input: "linear_to_mel_weight_matrix/frame/Reshape_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/GatherV2"
  op: "GatherV2"
  input: "linear_to_mel_weight_matrix/frame/Reshape_1"
  input: "linear_to_mel_weight_matrix/frame/add_2"
  input: "linear_to_mel_weight_matrix/frame/strided_slice"
  attr {
    key: "Taxis"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat_2/values_1"
  op: "Pack"
  input: "linear_to_mel_weight_matrix/frame/Maximum"
  input: "linear_to_mel_weight_matrix/frame/frame_length"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat_2/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/concat_2"
  op: "ConcatV2"
  input: "linear_to_mel_weight_matrix/frame/split"
  input: "linear_to_mel_weight_matrix/frame/concat_2/values_1"
  input: "linear_to_mel_weight_matrix/frame/split:2"
  input: "linear_to_mel_weight_matrix/frame/concat_2/axis"
  attr {
    key: "N"
    value {
      i: 3
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/frame/Reshape_4"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/frame/GatherV2"
  input: "linear_to_mel_weight_matrix/frame/concat_2"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/split/split_dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/split"
  op: "Split"
  input: "linear_to_mel_weight_matrix/split/split_dim"
  input: "linear_to_mel_weight_matrix/frame/Reshape_4"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "num_split"
    value {
      i: 3
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Reshape"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/split"
  input: "linear_to_mel_weight_matrix/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Reshape_1"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/split:1"
  input: "linear_to_mel_weight_matrix/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Reshape_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Reshape_2"
  op: "Reshape"
  input: "linear_to_mel_weight_matrix/split:2"
  input: "linear_to_mel_weight_matrix/Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/sub"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/ExpandDims"
  input: "linear_to_mel_weight_matrix/Reshape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/sub_1"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/Reshape_1"
  input: "linear_to_mel_weight_matrix/Reshape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/truediv_1"
  op: "RealDiv"
  input: "linear_to_mel_weight_matrix/sub"
  input: "linear_to_mel_weight_matrix/sub_1"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/sub_2"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/Reshape_2"
  input: "linear_to_mel_weight_matrix/ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/sub_3"
  op: "Sub"
  input: "linear_to_mel_weight_matrix/Reshape_2"
  input: "linear_to_mel_weight_matrix/Reshape_1"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/truediv_2"
  op: "RealDiv"
  input: "linear_to_mel_weight_matrix/sub_2"
  input: "linear_to_mel_weight_matrix/sub_3"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Minimum"
  op: "Minimum"
  input: "linear_to_mel_weight_matrix/truediv_1"
  input: "linear_to_mel_weight_matrix/truediv_2"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Maximum"
  op: "Maximum"
  input: "linear_to_mel_weight_matrix/Const"
  input: "linear_to_mel_weight_matrix/Minimum"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix/Pad"
  op: "Pad"
  input: "linear_to_mel_weight_matrix/Maximum"
  input: "linear_to_mel_weight_matrix/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "linear_to_mel_weight_matrix"
  op: "Cast"
  input: "linear_to_mel_weight_matrix/Pad"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "Tensordot/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Tensordot/range/limit"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "Tensordot/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Tensordot/range"
  op: "Range"
  input: "Tensordot/range/start"
  input: "Tensordot/range/limit"
  input: "Tensordot/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Tensordot/range_1/limit"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Tensordot/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Tensordot/range_1"
  op: "Range"
  input: "Tensordot/range_1/start"
  input: "Tensordot/range_1/limit"
  input: "Tensordot/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/Shape"
  op: "Shape"
  input: "AudioSpectrogram"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "Tensordot/GreaterEqual/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Tensordot/GreaterEqual"
  op: "GreaterEqual"
  input: "Tensordot/range"
  input: "Tensordot/GreaterEqual/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/Cast"
  op: "Cast"
  input: "Tensordot/GreaterEqual"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Tensordot/mul"
  op: "Mul"
  input: "Tensordot/Cast"
  input: "Tensordot/range"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Tensordot/Less"
  op: "Less"
  input: "Tensordot/range"
  input: "Tensordot/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/Cast_1"
  op: "Cast"
  input: "Tensordot/Less"
  attr {
    key: "DstT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "Tensordot/add"
  op: "Add"
  input: "Tensordot/range"
  input: "Tensordot/Rank"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/mul_1"
  op: "Mul"
  input: "Tensordot/Cast_1"
  input: "Tensordot/add"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/add_1"
  op: "Add"
  input: "Tensordot/mul"
  input: "Tensordot/mul_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Tensordot/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Tensordot/range_2"
  op: "Range"
  input: "Tensordot/range_2/start"
  input: "Tensordot/Rank"
  input: "Tensordot/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/ListDiff"
  op: "ListDiff"
  input: "Tensordot/range_2"
  input: "Tensordot/add_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "out_idx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Tensordot/Gather"
  op: "Gather"
  input: "Tensordot/Shape"
  input: "Tensordot/ListDiff"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "Tensordot/Gather_1"
  op: "Gather"
  input: "Tensordot/Shape"
  input: "Tensordot/add_1"
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tparams"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "Tensordot/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Tensordot/Prod"
  op: "Prod"
  input: "Tensordot/Gather"
  input: "Tensordot/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Tensordot/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
